{
  "irVersion": "1.0",
  "project": "priority-frameworks",
  "repository": "https://github.com/grokify/priority-frameworks",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-06-06",
      "highlights": [
        { "description": "Score-to-level mapping with built-in CVSS support, and level counting for dashboards and reports" }
      ],
      "added": [
        { "description": "`ScoreRange` type for mapping numeric score ranges to framework levels", "commit": "887ce33" },
        { "description": "`CVSSScoreRange()` built-in for CVSS v3 scores (0-10) to Severity levels", "commit": "887ce33" },
        { "description": "`PercentageScoreRange()` for percentage-based level mapping", "commit": "887ce33" },
        { "description": "`LevelFromScore()` and `MustLevelFromScore()` methods", "commit": "887ce33" },
        { "description": "`LevelCounts` type for tracking item counts per priority level", "commit": "d41727c" },
        { "description": "`Total()`, `ActionableTotal()`, `HigherThan()`, `LowerThan()` count aggregations", "commit": "d41727c" },
        { "description": "`Merge()`, `Clone()`, `Reset()` for combining and managing counts", "commit": "d41727c" },
        { "description": "`Slice()` returns counts in framework level order", "commit": "d41727c" }
      ],
      "tests": [
        { "description": "Comprehensive tests for ScoreRange and LevelCounts", "commit": "408bb6d" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-06-06",
      "commit": "a09fcbf",
      "highlights": [
        { "description": "Go library for standardized priority level definitions with 5 built-in frameworks and cross-framework normalization" }
      ],
      "added": [
        { "description": "Core `Framework` and `Level` types for defining priority systems", "commit": "b181fd0" },
        { "description": "Built-in `Severity` framework (Critical, High, Medium, Low, Info)", "commit": "57ffbb9" },
        { "description": "Built-in `Priority` framework (P0-P4 urgency levels)", "commit": "57ffbb9" },
        { "description": "Built-in `IETF` framework (RFC 2119 requirement levels: MUST, SHOULD, MAY)", "commit": "57ffbb9" },
        { "description": "Built-in `MoSCoW` framework (Must Have, Should Have, Could Have, Won't Have)", "commit": "57ffbb9" },
        { "description": "Built-in `General` framework (High, Medium, Low)", "commit": "57ffbb9" },
        { "description": "`Normalize()` function for converting levels to comparable numeric scale (0-100)", "commit": "7c598cd" },
        { "description": "`CompareAcross()` function for comparing priorities across different frameworks", "commit": "7c598cd" },
        { "description": "`MapTo()` function for finding equivalent levels between frameworks", "commit": "7c598cd" },
        { "description": "`GetLevelByID()` and `GetLevelByNameOrAlias()` lookup functions", "commit": "b181fd0" }
      ],
      "tests": [
        { "description": "Unit tests for framework lookups, normalization, and cross-framework comparison", "commit": "639b8fe" }
      ],
      "documentation": [
        { "description": "README with installation, usage examples, and API documentation", "commit": "5773511" },
        { "description": "Badge shields for CI, Go Report Card, and license", "commit": "32286b3" },
        { "description": "`All()` and `AllBuiltinIDs()` functions documented in README" },
        { "description": "Contributing section with link to CHANGELOG" }
      ],
      "build": [
        { "description": "GitHub Actions CI workflows for testing, linting, and CodeQL", "commit": "321a6fb" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "321a6fb" },
        { "description": "golangci-lint configuration with gosec, staticcheck, and other linters", "commit": "321a6fb" }
      ]
    }
  ]
}
